package com.ziguonnana.ziguserver.websocket.nickname.dto;

public enum Adjective {
    활발한, 용맹한, 극악무도한, 지혜로운, 강력한, 신비로운, 겸손한, 용감한,
    참을성있는, 자비로운, 충성스러운, 독창적인, 성실한, 단호한,
    섬세한, 기발한, 명랑한, 희망찬, 유머러스한, 이해심있는, 따뜻한, 헌신적인, 신중한, 격렬한,
    자신감있는, 침착한, 용의주도한, 매력적인, 호기심많은, 창의적인, 끈기있는, 진지한, 열정적인,
    공정한, 기꺼이돕는, 희생적인, 신뢰할수있는, 활기찬, 경쾌한, 쾌활한, 인내심강한, 호의적인,
    동정심많은, 의지가강한, 선량한, 긍정적인, 절제된, 참을성많은, 친화적인,
    세심한, 과묵한, 사려깊은, 온화한, 꼼꼼한, 유능한, 이타적인, 지적인, 숙련된,
    자애로운, 상냥한, 충직한, 근면한, 유쾌한, 사랑스러운, 친절한, 결단력있는,
    정중한, 명예로운, 대담한, 결의에찬, 설득력있는,주도적인,공손한, 정직한,
    // 부정적인 형용사
    게으른, 무기력한, 소심한, 우유부단한, 비겁한, 잔인한, 무관심한, 냉소적인,
    고집스러운, 무책임한, 오만한, 불성실한, 독단적인, 비관적인, 신뢰할수없는,
    질투심많은, 인색한, 무례한, 거만한, 시기심많은, 의심많은, 예민한, 성급한,
    무뚝뚝한, 냉정한, 얄미운, 불안정한, 불친절한,  무감각한, 고압적인,
    폭력적인, 집착하는, 탐욕스러운, 이기적인, 경솔한, 거짓된, 독선적인,
    비열한, 교활한, 빈정거리는, 방종한, 억지스러운, 거짓말하는, 무정한, 편견가득한,
    비협조적인, 무지한, 방탕한, 무식한, 나태한, 불평많은, 불평하는, 부주의한,
    냉담한, 의리없는, 욕심많은, 속이는, 뻔뻔한, 음흉한, 우울한, 
   무모한, 변덕스러운,성질급한, 무자비한,
}
