package com.ziguonnana.ziguserver.websocket.nickname.dto;

public enum AnimalName {
    호랑이, 사자, 독수리, 고래, 늑대, 코끼리, 곰,
    토끼, 여우, 팬더,  침팬지, 고양이, 개, 돼지, 악어, 코알라, 캥거루, 펭귄,
     매, 오리, 고슴도치, 하이에나, 재규어, 코요테, 라쿤, 수달, 얼룩말,
    바다사자, 돌고래, 홍학, 오소리, 알파카, 양, 염소, 닭, 앵무새,
    문어, 해파리, 불가사리, 해마, 고등어, 연어, 참치, 메기, 미꾸라지, 우렁이,
    뱀, 거북이, 도마뱀, 이구아나, 카멜레온, 두더지, 다람쥐, 청설모, 두루미, 학,
    사슴, 엘크, 순록, 비버, 비둘기, 까마귀, 갈매기, 수리부엉이, 올빼미, 참새,
    족제비, 여우원숭이, 고릴라, 오랑우탄, 말, 당나귀, 노새, 기린, 하마, 코뿔소,
    공작, 부엉이, 타조, 야크, 버팔로, 박쥐, 들소, 아르마딜로, 오리너구리, 큰뿔양;
}
