package com.ziguonnana.ziguserver.websocket.nickname.dto;

public enum FutureName {
    제논, 노바, 렉스, 오로라, 카이, 리아,  벡터,
    알파, 베타, 오메가, 쟈스퍼, 라크, 이온, 엘라, 코모, 니알, 제라,
    루크, 나이아, 자크, 크로노, 시그마, 아크, 테라, 아르곤, 퀀텀, 나노,
    네온, 사이안, 마크, 제노스, 네무, 가이아, 소닉, 테크, 제시카, 리온,
    아론, 엘론, 시리우스, 아틀라스, 보라, 제로, 네서스, 에리스, 아르카,
    제트, 시스코, 비욘, 아미라, 라미아, 크리오, 제트라, 플렉스, 이그나, 카디아,
    트론, 이로스, 닉스, 오닉스, 플레어, 카론, 크릭스, 아스트로, 이클립스, 스펙터,
    클라우드, 페가수스, 오딘, 네메시스, 헥터, 테세라, 메카, 지노, 라크스, 폴라리스,
    스카이, 제로스, 카시오, 퓨전, 블레이즈, 샤드, 제이드, 아르카디아, 쿼크, 제타;
}
