package com.ziguonnana.ziguserver.websocket.nickname.dto;

public enum JoseonName {
    김덕구, 박돌쇠, 이갑돌, 장삼식, 최말자, 정칠복, 한점례, 윤말봉,
    신두칠, 오복녀, 문갑수, 강칠성, 홍길수, 권삼돌, 백득수, 송칠복,
    서방녀, 황득돌, 노칠복, 장돌이, 심봉사, 고대순, 주점례, 차만돌,
    안칠복, 조만득, 염삼돌, 나이순, 채두칠, 함덕구, 도복순, 마돌쇠,
    우만돌, 남칠성, 구돌쇠, 전칠복, 유점례, 임삼돌, 변득수, 방덕구,
    강삼돌, 정오복, 윤칠득, 원점례, 민복구, 천만돌, 홍칠성, 노갑수,
    배덕순, 송점례, 문칠복, 박삼돌, 강오복, 오득순, 신만돌, 윤칠봉,
    황돌쇠, 서점례, 이득돌, 장오복, 한돌쇠, 조복순, 정칠돌, 이만득,
    장삼돌, 최덕구, 김돌쇠, 김만돌, 박칠봉, 오점례, 송오복, 황삼돌,
    차만득, 정돌쇠, 윤갑돌, 최덕순, 허칠성, 문덕구, 강삼복, 박오복;
}
