package com.ziguonnana.ziguserver.websocket.nickname.dto;

public enum MedievalName {
    아서, 랜슬롯, 기네비어, 트리스탄, 모르가나, 멀린, 퍼시벌, 갈라하드,
    리처드, 헨리, 엘리자베스, 제임스, 캐서린, 에드워드, 윌리엄, 조지, 앤, 잔,
    피터, 헬레나, 루크, 아그네스, 바바라, 찰스, 클레어, 다니엘, 에마, 프레드릭,
    가브리엘, 헬렌, 이사벨, 존, 칼, 리사, 마거릿, 니콜라스, 오웬, 필립,
    쿼터메인, 로빈, 사이먼, 셀리나, 세드릭, 터렛, 우서, 월드프리드, 위버, 하이메,
    알리사, 버나드, 클리오, 드레이크, 에반, 페르난도, 기르모, 하겐, 이도라, 자비스,
    케일리, 라이언, 맥스웰, 나단, 올리버, 페리, 퀸시, 루퍼트, 셀윈, 토마스,
    유리, 발렌티노, 크리스틴, 다이애나, 에드문드, 파올라, 마르코, 노아, 오스카, 파블로,
    레지나, 살바토르, 타냐, 울프, 비올라, 젠, 아르네, 브렌든, 캐스퍼, 다프네,
    엘리엇, 피아, 그리핀, 헬라, 이고르, 저스틴, 케틀린, 로이스, 모건, 네빌;
}
